app/controllers/linebot_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
    def callback

      # Postモデルの中身をランダムで@postに格納する
      @post=Post.offset( rand(Post.count) ).first